In [1]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis_kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis_kelamin kelas
0         1  Matematika     99     laki-laki   12D
1         2     Biologi     72     laki-laki   12C
2         3     Biologi     13     laki-laki   12B
3         4     Geologi     45     laki-laki   12B
4         5     Biologi     27     laki-laki   12C

<h2>Quiz 1 : Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [2]:
# code here
# Untuk mengakses data dari column nilai dan kelas saja
df.loc[0:, ['nilai', 'kelas']]

    nilai kelas
0      99   12D
1      72   12C
2      13   12B
3      45   12B
4      27   12C
5      43   12C
6      66   12D
7      76   12D
8       2   12D
9      80   12D
10     66   12B
11     16   12A
12     58   12D
13     15   12B
14     44   12B
15     46   12A
16     51   12D
17     63   12D
18      5   12D
19     89   12C

In [3]:
# UNtuk mengakses data dari nomor 5-10 dan mengambil nilai dari column pelajaran dan nilai nya saja
df.loc[5:10, ['pelajaran', 'nilai']]

     pelajaran  nilai
5      Geologi     43
6        Kimia     66
7      Geologi     76
8      Biologi      2
9   Matematika     80
10  Matematika     66

In [4]:
# Untuk mengakses nilai data dari nomor 5-10 Full
df.loc[5:10]

    siswa_id   pelajaran  nilai jenis_kelamin kelas
5          6     Geologi     43     perempuan   12C
6          7       Kimia     66     laki-laki   12D
7          8     Geologi     76     laki-laki   12D
8          9     Biologi      2     laki-laki   12D
9         10  Matematika     80     laki-laki   12D
10        11  Matematika     66     perempuan   12B

<h2>Quiz 2 : Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [5]:
# code here
print("=====Jawaban No.1=====")
data_ekonomi = df.pelajaran == 'Ekonomi'
data_fisika = df.pelajaran == 'Fisika'
print(df[(data_ekonomi) | (data_fisika)])

=====Jawaban No.1=====
    siswa_id pelajaran  nilai jenis_kelamin kelas
18        19   Ekonomi      5     laki-laki   12D

In [6]:
dp_gabungan = (df['pelajaran'] == 'Ekonomi') | (df['pelajaran'] == 'Fisika')
df[dp_gabungan]

    siswa_id pelajaran  nilai jenis_kelamin kelas
18        19   Ekonomi      5     laki-laki   12D

In [7]:
print("=====Jawaban No.2=====")
data_kimia = df.pelajaran == 'Kimia'
data_nilai = df.nilai > 50
print(df[(data_kimia) & (data_nilai)])

=====Jawaban No.2=====
   siswa_id pelajaran  nilai jenis_kelamin kelas
6         7     Kimia     66     laki-laki   12D

In [8]:
dp_gabungan2 = (df['pelajaran'] == 'Kimia') & (df['nilai'] > 50)
df[dp_gabungan2]

   siswa_id pelajaran  nilai jenis_kelamin kelas
6         7     Kimia     66     laki-laki   12D

In [9]:
print("=====Jawaban No.3=====")
data_perempuan = df.jenis_kelamin == 'perempuan'
data_kelas = df.kelas == '12C'
data_nilai_perempuan = df.nilai > 70
print(df[(data_perempuan) & (data_kelas) & (data_nilai_perempuan)])

=====Jawaban No.3=====
    siswa_id   pelajaran  nilai jenis_kelamin kelas
19        20  Matematika     89     perempuan   12C

In [10]:
dp_gabungan3 = (df['jenis_kelamin'] == 'perempuan') & (df['kelas'] == '12C') & (df['nilai'] > 70)
df[dp_gabungan3]

    siswa_id   pelajaran  nilai jenis_kelamin kelas
19        20  Matematika     89     perempuan   12C

<h2>Quiz 3 : Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![image.png](attachment:image.png)

In [11]:
df.describe()

       siswa_id      nilai
count  20.00000  20.000000
mean   10.50000  48.800000
std     5.91608  28.500416
min     1.00000   2.000000
25%     5.75000  24.250000
50%    10.50000  48.500000
75%    15.25000  67.500000
max    20.00000  99.000000

In [12]:
# code here
# Nilai awal sebelum di kurangi
print(df.nilai)

0     99
1     72
2     13
3     45
4     27
5     43
6     66
7     76
8      2
9     80
10    66
11    16
12    58
13    15
14    44
15    46
16    51
17    63
18     5
19    89
Name: nilai, dtype: int64

In [13]:
# Nilai Minimun 
print(df.nilai.min())

2

In [0]:
def min_10(x):
    return (x - 10)/(99 - 10)

In [16]:
df['nilai'].apply(min_10)

0     1.000000
1     0.696629
2     0.033708
3     0.393258
4     0.191011
5     0.370787
6     0.629213
7     0.741573
8    -0.089888
9     0.786517
10    0.629213
11    0.067416
12    0.539326
13    0.056180
14    0.382022
15    0.404494
16    0.460674
17    0.595506
18   -0.056180
19    0.887640
Name: nilai, dtype: float64